
        // задача номер 1 присвоить переменным значения и вывести на консоль
public class Main {
    public static void main(String[] args) {
        var dog = 8.0;
        var cat = 3.6;
        var paper = 763789;
        System.out.println("Задача N1");
        System.out.println("dog=" + dog);
        System.out.println("cat=" + cat);
        System.out.println("paper=" + paper);

        //  Задача номер 2 увеличить переменные на 4
        dog = dog + 4;
        cat = cat + 4;
        paper = paper + 4;
        System.out.println("Задача N2");
        System.out.println("dog=" + dog);
        System.out.println("cat=" + cat);
        System.out.println("paper=" + paper);

        dog = dog-3.5;
        cat = cat-1.6;
        paper = paper-7639;
        System.out.println("Задача N3");
        System.out.println("dog=" + dog);
        System.out.println("cat=" + cat);
        System.out.println("paper=" + paper);

        //Задача 4
        //Инициализируйте (присвойте значение) переменную friend значением 19.
        //Увеличьте значение переменной на 2, после чего поделите значение на 7.
        var friend=19;
        System.out.println("Задача N4");
        System.out.println(friend);
        friend=friend*2;
        System.out.println(friend);
        friend=friend/7;
        System.out.println(friend);




    }
}
